Revit 2024 API
TransactionAttribute Members
The TransactionAttribute type exposes the following members.
Constructors
Name | Description
TransactionAttribute
Constructs a new TransactionAttribute.
Methods
Name | Description
Equals
Returns a value that indicates whether this instance is equal to a specified object.
 (Inherited from Attribute.)
GetHashCode
Returns the hash code for this instance.
 (Inherited from Attribute.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsDefaultAttribute
When overridden in a derived class, indicates whether the value of this instance is the default value for the derived class.
 (Inherited from Attribute.)
Match
When overridden in a derived class, returns a value that indicates whether this instance equals a specified object.
 (Inherited from Attribute.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Mode
Transaction mode.
TypeId
When implemented in a derived class, gets a unique identifier for this Attribute.
 (Inherited from Attribute.)
See Also
TransactionAttribute Class
Autodesk.Revit.Attributes Namespace